{
    "English": "Inglés",
    "Spanish": "Español",
    "Home": "Inicio",
    "About": "Sobre mí",
    "Projects": "Proyectos",
    "Skills": "Aptitudes",
    "Experience": "Experiencia",
    "Contact": "Contacto",
    "Download CV": "Descargar CV",
    "About me": "Sobre mí",
    "When I'm not immersed in code, I enjoy playing video games, from popular titles to indie gems, always on the lookout for hidden treasures. ": "Cuando no estoy inmerso programando, disfruto jugando a videojuegos, desde títulos populares a joyas independientes, siempre a la caza de tesoros ocultos. ",
    "I'm also a cinema enthusiast, having completed a small course in filmmaking. However, when I seek a break from technology, ": "También soy un entusiasta del cine, habiendo realizado un pequeño curso de dirección cinematográfica. Sin embargo, cuando busco un descanso de la tecnología, ",
    "I find solace in reading and exploring the worlds of fantasy and science fiction, or simply spending quality time with my cat.": "disfruto leyendo y explorando los mundos de la fantasía y la ciencia ficción, o simplemente pasando tiempo con mi gato.",
    "My projects": "Mis proyectos",
    "More Info": "Más información",
    "Shuvani is an Isometric Single Player Roguelike where action and strategy complement each other in a unique combat system based on magic and music.": "Shuvani es un roguelike isométrico de un jugador donde la acción y estrategia se complementan en un combate único de mágia y fantasía.",
    "Customer, employee and material management in an underwater club. I was a programmer. Created for the IndieSpainJam in one week.": "Administra clientes, empleados y recursos en un club abisal. Fui programador. Creado para la IndieSpainJam en una semana.",
    "Real-time sensor management and monitoring. I was the full-stack developer. It has features like filtering, sorting and paging, as well as a Rest API.": "Administración y monitorización de sensórica en tiempo real. Fui el desarrollador full-stack. Tiene funciones como filtrar, ordenar y paginar, asi como una API Rest.",
    "Manage the use and reseravtion of parking spaces in your office, easily and efficiently.": "Administra fácillmente y eficientemente el uso y reservas de espacios de estacionamiento en tu oficina.",
    "Great": "Genial",
    "Ok": "Ok",
    "Good": "Bien",
    "Shuvani is an ": "Shuvani es un ",
    "Isometric Single Player Roguelike": "roguelike isométrico de un jugador",
    " where action and strategy complement each other in a unique combat system based on magic and music.": " donde la acción y estrategia se complementan la una a la otra para crear un combate único en magia y música.",
    "Unleash your inner power and fulfill your destiny.": "Desata tu poder interno y cumple tu destino.",
    "AboutProject": "Sobre el proyecto",
    "Details": "Detalles",
    "Technologies Used:": "Tecnologías usadas:",
    "Programming Language: ": "Lenguaje de programación: ",
    "Currently, we are looking forward to presenting the project at the ": "Actualmente, estamos apuntado a presentar el proyecto en los ",
    "PlayStation Talents Spain": "PlayStation Talents Spain",
    " event.": ".",
    "Available on ": "Disponible en ",
    "Tasks": "Tareas",
    "In one of the most mysterious and uncharted realms of the vast ocean, where sunlight never dares to venture, lies Nautiloose Club an enticing nocturnal haven within the Abyssal Zone. Here, amidst the depths, emerges a thriving nightclub, teeming with abyssal fish, jellyfish, and giant squids as they awaken with the night.": "En uno de los reinos más misteriosos e inexplorados del vasto océano, donde la luz del sol nunca se atreve a aventurarse, se encuentra el Club Nautiloose, un tentador refugio nocturno dentro de la Zona Abisal. Aquí, en medio de las profundidades, emerge un próspero club nocturno, rebosante de peces abisales, medusas y calamares gigantes que despiertan con la noche.",
    "Dive into the enigmatic aquatic world of Nautiloose Club, embracing the role of a ": "Sumérjete en el enigmático mundo acuático del Club Nautiloose, asumiendo el papel de ",
    "club manager": "gerente de un club",
    " in this beacon of untapped potential.": " en este faro de potencial sin explotar.",
    "I was responsible for creating the ": "Fuí responsable de crear las interfaces del ",
    "main menu, options, and credits": "menú principal, opciones y créditos",
    " interfaces, as well as implementing seamless navigation between them.": ", asi como implementar la navegación entre ellos. ",
    "I also handled the integration of all sound-related aspects using ": "Tambien me encargué de integrar todo lo relacionado con el sonido usando ",
    "Furthermore, I took on the tasks of ": "Ademas, me he encargado de tareas como ",
    "level design, blocking, and dressing": "diseño de nivel, blocking y vestido",
    ". I ": ". Yo ",
    "incorporated animations": "incorporé las animaciones",
    " for the customers and developed materials for plant movement.": " para los clientes y desarrolle el material de movimiento de las plantas.",
    "I also held the responsibility of ": "Tambien asumí la responsabilidad de ",
    "managing both customers and dancers": " administrar los clientes y bailarines",
    " during the night. For customers, I oversaw their entry and exit from the bar, as well as took care of their orders. As for the dancers, I coordinated their patrols throughout different areas of the bar and their performances for the customers' enjoyment.": " durante la noche. Para los clientes, supervisaba su entrada y salida del bar, así como me ocupaba de sus pedidos. En cuanto a las bailarinas, coordinaba sus patrullas por las distintas zonas del bar y sus servicios para disfrute de los clientes."
}