{
    "English": "Inglés",
    "Spanish": "Español",
    "Home": "Inicio",
    "About": "Sobre mí",
    "Projects": "Proyectos",
    "Skills": "Aptitudes",
    "Experience": "Experiencia",
    "Contact": "Contacto",
    "Download CV": "Descargar CV",
    "About me": "Sobre mí",
    "When I'm not immersed in code, I enjoy playing video games, from popular titles to indie gems, always on the lookout for hidden treasures. ": "Cuando no estoy inmerso programando, disfruto jugando a videojuegos, desde títulos populares a joyas independientes, siempre a la caza de tesoros ocultos. ",
    "I'm also a cinema enthusiast, having completed a small course in filmmaking. However, when I seek a break from technology, ": "También soy un entusiasta del cine, habiendo realizado un pequeño curso de dirección cinematográfica. Sin embargo, cuando busco un descanso de la tecnología, ",
    "I find solace in reading and exploring the worlds of fantasy and science fiction, or simply spending quality time with my cat.": "disfruto leyendo y explorando los mundos de la fantasía y la ciencia ficción, o simplemente pasando tiempo con mi gato.",
    "My projects": "Mis proyectos",
    "More Info": "Más información",
    "Shuvani is an Isometric Single Player Roguelike where action and strategy complement each other in a unique combat system based on magic and music.": "Shuvani es un roguelike isométrico de un jugador donde la acción y estrategia se complementan en un combate único de mágia y fantasía.",
    "Customer, employee and material management in an underwater club. I was a programmer. Created for the IndieSpainJam in one week.": "Administra clientes, empleados y recursos en un club abisal. Fui programador. Creado para la IndieSpainJam en una semana.",
    "Real-time sensor management and monitoring. I was the full-stack developer. It has features like filtering, sorting and paging, as well as a Rest API.": "Administración y monitorización de sensórica en tiempo real. Fui el desarrollador full-stack. Tiene funciones como filtrar, ordenar y paginar, asi como una API Rest.",
    "Manage the use and reseravtion of parking spaces in your office, easily and efficiently.": "Administra fácillmente y eficientemente el uso y reservas de espacios de estacionamiento en tu oficina.",
    "Great": "Genial",
    "Ok": "Ok",
    "Good": "Bien",
    "Shuvani is an ": "Shuvani es un ",
    "Isometric Single Player Roguelike": "roguelike isométrico de un jugador",
    " where action and strategy complement each other in a unique combat system based on magic and music.": " donde la acción y estrategia se complementan la una a la otra para crear un combate único en magia y música.",
    "Unleash your inner power and fulfill your destiny.": "Desata tu poder interno y cumple tu destino.",
    "AboutProject": "Sobre el proyecto",
    "Details": "Detalles",
    "Technologies Used:": "Tecnologías usadas:",
    "Programming Language: ": "Lenguaje de programación: ",
    "Currently, we are looking forward to presenting the project at the ": "Actualmente, estamos apuntado a presentar el proyecto en los ",
    "PlayStation Talents Spain": "PlayStation Talents Spain",
    " event.": ".",
    "Available on ": "Disponible en ",
    "Tasks": "Tareas",
    "In one of the most mysterious and uncharted realms of the vast ocean, where sunlight never dares to venture, lies Nautiloose Club an enticing nocturnal haven within the Abyssal Zone. Here, amidst the depths, emerges a thriving nightclub, teeming with abyssal fish, jellyfish, and giant squids as they awaken with the night.": "En uno de los reinos más misteriosos e inexplorados del vasto océano, donde la luz del sol nunca se atreve a aventurarse, se encuentra el Club Nautiloose, un tentador refugio nocturno dentro de la Zona Abisal. Aquí, en medio de las profundidades, emerge un próspero club nocturno, rebosante de peces abisales, medusas y calamares gigantes que despiertan con la noche.",
    "Dive into the enigmatic aquatic world of Nautiloose Club, embracing the role of a ": "Sumérjete en el enigmático mundo acuático del Club Nautiloose, asumiendo el papel de ",
    "club manager": "gerente de un club",
    " in this beacon of untapped potential.": " en este faro de potencial sin explotar.",
    "I was responsible for creating the ": "Fuí responsable de crear las interfaces del ",
    "main menu, options, and credits": "menú principal, opciones y créditos",
    " interfaces, as well as implementing seamless navigation between them.": ", asi como implementar la navegación entre ellos. ",
    "I also handled the integration of all sound-related aspects using ": "Tambien me encargué de integrar todo lo relacionado con el sonido usando ",
    "Furthermore, I took on the tasks of ": "Ademas, me he encargado de tareas como ",
    "level design, blocking, and dressing": "diseño de nivel, blocking y vestido",
    ". I ": ". Yo ",
    "incorporated animations": "incorporé las animaciones",
    " for the customers and developed materials for plant movement.": " para los clientes y desarrolle el material de movimiento de las plantas.",
    "I also held the responsibility of ": "Tambien asumí la responsabilidad de ",
    "managing both customers and dancers": " administrar los clientes y bailarines",
    " during the night. For customers, I oversaw their entry and exit from the bar, as well as took care of their orders. As for the dancers, I coordinated their patrols throughout different areas of the bar and their performances for the customers' enjoyment.": " durante la noche. Para los clientes, supervisaba su entrada y salida del bar, así como me ocupaba de sus pedidos. En cuanto a las bailarinas, coordinaba sus patrullas por las distintas zonas del bar y sus servicios para disfrute de los clientes.",
    "Neutrum is a project developed in response to critical challenges in managing data generated by": "Neutrum es un proyecto desarrollado en respuesta de las dificultades a la hora de gestionar los datos generados por",
    " IoT devices": " dispositivos IoT",
    " for the company ": " para la empresa ",
    " I was in charge of leading the remodeling initiative for this project due to usability, performance, and functionality issues in the previous version.": " Estuve al cargo de liderar la remodelacion del proyecto, debido a mejoras en usabilidad, rendimiento y funcionalidad de su version anterior.",
    "Neutrum's main objective is to act as an efficient intermediary between IoT devices and the applications that require data from these devices.": "El principal objetivo de Neutrum es actuar como un intermediario eficiente entre los dispositivos IoT y la aplicacion que requiere los datos de esos dispositivos.",
    " It effectively connects to a variety of IoT devices, collects ": " Se conecta eficazmente a una gran variedad de dispositivos IoT, recoge ",
    "real-time data": "datos en tiempo real",
    ", and": ", y ",
    " normalizes": " normaliza",
    " it into a standardized format. This allows for easier management of large volumes of data,": " los datos en un formato mas estandar. Esto permite una gestion mas facil para un volumen grande de datos,",
    "simplifies maintenance, and structures the data uniformly, making it easier for other applications and systems to exploit.": "simplifica mantenimiento, y estructura los datos de forma uniforme, facilitando su explotacion por parte de otras aplicaciones y sistemas.",
    "The Frontend has been created using ": "El frontend ha sido creado mediante ",
    "JavaScript and React": "JavaScript y React",
    ". Additionally, the ": ". Adicionalmente, se ha usado el paquete de ",
    " suite of components and tools has been used.": " con componentes y herramientas.",
    "The Backend is developed in ": "El backend ha sido desarrollado en ",
    "Java and Spring": "Java y Spring",
    ". The database is with ": ". La base de datos es con ",
    "JDBC and SQL Server": "JDBC y SQL Server",
    "Creation of the ": "Creacion del módulo de ",
    "Administration": "Administración",
    " Frontend: An administration interface was developed to allow users to create, edit, or delete database elements. Users can view a table with the existing data, such as sensors, locations, devices, etc.": ": Una interfaz de administracion fue desarrollada para permitir a los usuarios crear, editar, o borrar elementos de la base de datos. Los usuarios pueden ver una tabla con los elementos actuales, como sensores, localizaciones o dispositivos entre otros.",
    "Creation of a ": "Creación del módulo de ",
    "Monitoring": "Monitoreo",
    " Frontend: An interface that allows users to view data collected by sensors, perform tests on devices, locate them on the map, and more.": ": Una interfaz que permite a los usuarios ver los datos recolectados por los sensores, realizar pruebas en dispositivos, localizarlos en el mapa y más.",
    "Dashboard": "Dashboard",
    " Frontend: An interface for users to visualize current device measurements through graphs.": ": Una interfaz para que los usuarios visualicen los datos de los dispositivos mediante gráficos.",
    "API optimization": "Optimización de la API",
    ": Modifications were made to the backend to enhance the efficiency of queries through the API.": ": Se realizaron modificaciones en el backend para mejorar la eficiencias de las queries mediante la API.",
    "Refactoring and optimization": "Refactor y optimización",
    " of Java code: Changes were made to the existing Java code to improve its structure and performance.": " de código Java: Se realizaron cambios al Java anterior para mejorar su estructura y rendimiento.",
    "The Parking Booking project stems from Archibus' Workplace module with the aim of providing users with a fast and ": "El proyecto de reservas de estacionamiento surge del módulo Workplace de Archibus con el objetivo de proporcionar a los usuarios un sistema ",
    "easy way to reserve parking spaces": "de reserva rápido y eficiente",
    " It has been designed following the standards of other applications, maintaining coherence both in its aesthetics and functionality.": " Se ha diseñado siguiendo los estándares de otras aplicaciones, manteniendo la coherencia tanto en su estética como en su funcionalidad.",
    " Personally, I was responsible for its comprehensive development, from ": "Personalmente, fui responsable de su desarrollo integral, desde ",
    "creating the database": "crear la base de datos",
    " to implementing necessary ": " hasta implementar las ",
    "backend functions": "funciones en el backend",
    " and building the entire": " y construir al completo",
    " frontend using React": " el frontend usando React",
    "Parking Area Reservations divided into two types:": "La reserva de estacionamiento se divide en dos tipos:",
    "Unassigned": "Sin plaza asignada",
    " Parking Areas: Represent parking spaces where users don’t select an exact space but have a ": ": Representan espacios de estacionamiento donde los usuarios no seleccionan un espacio espeficio pero tienen un ",
    "pool of options upon arrival": "conjnto de opciones cuando llegan",
    "Assigned": "Con plaza asignada",
    " Parking Areas: Represent parking spaces where users ": ": Representan espacios de estacionamiento donde los usuarios ",
    "must choose a specific space on the floorplan": "deben escoger un espacio especifico en el plano",
    "Users can select their preferred ": "Los usuarios pueden elegir su preferencia por ",
    "time slot": "la franja horaria",
    " from the available options within the area. Additionally, they can specify whether the reservation is for ": " de las áreas disponibles. Por otro lado, podran especificar si la reserva es para ",
    "themselves, another available employee, or a visitor": "ellos mismo, otro empleado, o una visita",
    "Calendar Overview: Users can ": "Calendario: los usuarios pueden ",
    "view their reservations on a calendar": "ver sus reservas en un calendario",
    ". By clicking on each reservation, they can access its details, location on the map, and have the option to ": ". Pulsando en cada reserva, podrán acceder a sus detalles, localizacion en el plano, y tienen la opcion de ",
    "confirm or cancel": "confirmarla o cancelarla",
    " it.": ".",
    "Administrative Views in Archibus: Admins can easily ": "Vistas de administrador en Archibus: Los administradores pueden facilmente ",
    "manage all data": "manejar todos los datos",
    ". This includes configuring parking areas, time slots, assigned spaces, and associated employees. They also have the ability to set up reservation confirmation requirements.": ". Esto incluye configurar las áreas de estacionamiento, franjas horarias, plazas, y empleados asignados. Tambien pueden configurar si se requiere de confirmacion en las reservas.",
    "Integration with the client’s ": "Integracion con ",
    "Access Control System": "el sistemas de control de accesos",
    ": This integration occurs in two ways:": ": Esta integracion ocurre de dos formas:",
    "Daily synchronization": "Sincronización diaria",
    " to report accesses for the following day.": " donde se informa de los accesos del día siguiente.",
    "Real-time updates": "Sincronizacion en tiempo real",
    " to report accesses at the time of reservation.": " donde se informa de los accesos a la hora de realizar la reserva.",
    "My skills": "Mis Aptitudes",
    "My experience": "Mi Experiencia",
    "About this website: ": "Sobre la página: ",
    "built with React & Next.js , TypeScript, Tailwind CSS, Framer Motion, React Email & Resend, Vercel hosting.": " creada a partir de React & Next.js, TypeScript, Tailwind CSS, Framer Motion, React Email & Resend, Vercel.",
    "Embark on a fiery journey in Valencia as the Fallera Mayor battles demons for the Holy Grail in this explosive 2.5D FPS odyssey.": "Embárcate en un ardiente viaje por Valencia mientras la Fallera Mayor lucha contra los demonios por el Santo Grial en esta explosiva odisea FPS en 2.5D.",
    "One of my main responsibilities was designing the ": "Una de mis principales responsabilidades fue el diseño del ",
    "behavior and attacks of enemies": "comportamiento y ataques de enemigos",
    ", specifically the melee, dasher, and the one that spawns enemies upon death. I also implemented the ": ", especificamente del melee, dasher y el que genera enemigos al morir. Tambien he implementado el ",
    "player's dash.": "dash del jugador.",
    "Additionally, I took the lead in creating the ": "Además, me encargué de crear el ",
    "statistics system": "sistema de estadísticas",
    " for both the player and enemies. After completing this task, I handled the game's ": " para el jugador y los enemigos. Tras completar esto, desarrollé los ",
    "pickables": "recolectables",
    ", including healing items and devices to reduce weapon overheating.": ", incluyendo objetos de curacion y otros para reducir el calentamiento del arma.",
    "On the other hand, I designed the ": "Por otro lado, he diseñado el ",
    "options and credits menu": "menú de opciones y créditos",
    ". Within the options, various graphical, sound, gameplay, and language options were incorporated, with support for ": ". Dentro de las opciones encontramos una gran variedad de configuraciones gráficas, sonoras, de gameplay, y lenguaje, con soporte para ",
    "English, Spanish, and Valencian.": "ingles, español y valenciano.",
    "Finally, I was in charge of a diverse range of ": "Por último, estuve encargado de los ",
    "in-game visual effects": "VFX",
    ", with a particular emphasis on ": ", con particular énfasis en el ",
    "fire": "fuego",
    " effects used in combat zone walls, map boundaries, and enemy projectiles, as well as the implementation of ": " usado en las paredes de zonas de combate, límites de mapa, y proyectiles enemigos, asi como la creación de ",
    "fireworks": " fuegos artificiales.",
    " effects.": "",
    "Explore vibrant Valencia in an exhilarating odyssey where magic and tradition collide.  As the courageous Fallera Mayor, armed with a firecracker pistol, recover the stolen Holy Grail from ruthless demons in the majestic cathedral. Traverse the city in flames, confronting infernal enemies amid centuries-old fallas and narrow alleys.": "Explora la vibrante Valencia en una estimulante odisea en la que chocan magia y tradición.  En el papel de la valiente Fallera Mayor, armada con una pistola petarda, recupera el Santo Grial robado a los despiadados demonios en la majestuosa catedral. Atraviesa la ciudad en llamas, enfrentándote a enemigos infernales entre fallas centenarias y callejones estrechos.",
    "Do you possess the skill to halt these malevolent intruders? Brace for an explosive fusion of tradition, action, and folklore in this unforgettable pyrotechnic challenge.": "¿Posees la habilidad necesaria para detener a estos malévolos intrusos? Prepárate para una explosiva fusión de tradición, acción y folclore en este inolvidable desafío pirotécnico.",
    "The battle for Valencia has commenced, and the salvation of the city's sacred flame rests in your hands!": "La batalla por Valencia ha comenzado y la salvación de la llama sagrada de la ciudad está en tus manos."
}